Repository: gavinmulligan/amg
Catalog: lang/blogtheme-*.po
Languages: ro_ro

source: &laquo; Older Entries
ro_ro: &laquo; Postări Mai Vechi

source: (required)
ro_ro: (este nevoie)

source: <em>404</em> Error!
ro_ro: <em>404</em> Eroare!

source: All Rights Reserved. BlogTheme by
ro_ro: Drepturile sunt rezervate. BlogTheme de

source: Archive
ro_ro: Arhivă

source: Archives
ro_ro: Arhive

source: Author Archives
ro_ro: Arhivele Autorului

source: By
ro_ro: De

source: Categories
ro_ro: Categorii

source: Comments
ro_ro: Comentarii

source: Continue Reading...
ro_ro: Continue cititul...

source: Direct link to this comment
ro_ro: Link direct la acest comentariu

source: Edit
ro_ro: Editează

source: Hi, Stranger! Leave Your Comment...
ro_ro: Salut necunoscutule! Lasă un comentariu...

source: Home
ro_ro: Acasă

source: In
ro_ro: În

source: Logged in as
ro_ro: Conectat ca

source: Logout &raquo;
ro_ro: Deconectează-te &raquo;

source: Message
ro_ro: Mesaj

source: Monthly Archives
ro_ro: Arhivă Lunară

source: Name
ro_ro: Nume

source: Newer Entries &raquo;
ro_ro: Postări Noi &raquo;

source: Pages
ro_ro: Pagini

source: Search Results
ro_ro: Rezultatele Căutării

source: Sitemap
ro_ro: Mapa Sitului

source: Sorry! None has been found...
ro_ro: Ne pare rău! Nu s-a găsit nici un rezultat...

source: Submit Comment
ro_ro: Trimite Conținut

source: Tag Archive
ro_ro: Arhiva de taguri

source: The Last 30 Posts
ro_ro: Ultimele 30 De Articole

source: This post is password protected. Enter the password to view comments.
ro_ro: Articolul este protejat. Introduceți codul pentru a vedea comentarile.

source: Unfortunately we were not able to find that page you were looking for...
ro_ro: Din păcate nu am găsit ceea ce căutați...

source: We suggest that you try going back one page or visit
ro_ro: Vă sugerăm sa va duceți înapoi sau să vizitați

source: Website
ro_ro: Site

source: What is this?
ro_ro: Ce este aceasta?

source: Where it all began
ro_ro: Unde totul a început

source: You are currently browsing the archives
ro_ro: Dvs. acuma răscoliți arhivele

source: You are currently browsing the archives for
ro_ro: Dvs. acuma răscoliți arhivele pentru

source: You are currently browsing the search results for
ro_ro: Dvs. acuma răscoliți resultatele cautarii pentru

source: You are currently browsing the tag archives for
ro_ro: Dvs. acuma răscoliți arhivele de taguri pentru

source: You must be
ro_ro: Tu trebuie să

source: Your comment is awaiting moderation
ro_ro: Comentariul Dvs. se afla in moderație

source: at
ro_ro: la

source: instead
ro_ro: în loc de

source: logged in
ro_ro: Conectat

source: our homepage
ro_ro: pagina noastră

source: to post a comment.
ro_ro: a publica un comentariu
